<a href="https://colab.research.google.com/github/vinayjoshva/PDS-assignments/blob/main/Assignment2_16352584.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [21]:
import pandas as pd
import numpy as np

# Load the CSV file into a DataFrame
df = pd.read_csv('train.csv')

# Display the first few rows of the DataFrame
print(df)

      Unnamed: 0                              Name    Location  Year  \
0              1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1              2                      Honda Jazz V     Chennai  2011
2              3                 Maruti Ertiga VDI     Chennai  2012
3              4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4              6            Nissan Micra Diesel XV      Jaipur  2013
...          ...                               ...         ...   ...
5842        6014                  Maruti Swift VDI       Delhi  2014
5843        6015          Hyundai Xcent 1.1 CRDi S      Jaipur  2015
5844        6016             Mahindra Xylo D4 BSIV      Jaipur  2012
5845        6017                Maruti Wagon R VXI     Kolkata  2013
5846        6018             Chevrolet Beat Diesel   Hyderabad  2011

      Kilometers_Driven Fuel_Type Transmission Owner_Type     Mileage  \
0                 41000    Diesel       Manual      First  19.67 kmpl
1                 46000    Petrol       Manual      First    13 km/kg
2                 87000    Diesel       Manual      First  20.77 kmpl
3                 40670    Diesel    Automatic     Second   15.2 kmpl
4                 86999    Diesel       Manual      First  23.08 kmpl
...                 ...       ...          ...        ...         ...
5842              27365    Diesel       Manual      First   28.4 kmpl
5843             100000    Diesel       Manual      First   24.4 kmpl
5844              55000    Diesel       Manual     Second   14.0 kmpl
5845              46000    Petrol       Manual      First   18.9 kmpl
5846              47000    Diesel       Manual      First  25.44 kmpl

       Engine      Power  Seats  New_Price  Price
0     1582 CC  126.2 bhp    5.0        NaN  12.50
1     1199 CC   88.7 bhp    5.0  8.61 Lakh   4.50
2     1248 CC  88.76 bhp    7.0        NaN   6.00
3     1968 CC  140.8 bhp    5.0        NaN  17.74
4     1461 CC   63.1 bhp    5.0        NaN   3.50
...       ...        ...    ...        ...    ...
5842  1248 CC     74 bhp    5.0  7.88 Lakh   4.75
5843  1120 CC     71 bhp    5.0        NaN   4.00
5844  2498 CC    112 bhp    8.0        NaN   2.90
5845   998 CC   67.1 bhp    5.0        NaN   2.65
5846   936 CC   57.6 bhp    5.0        NaN   2.50

[5847 rows x 14 columns]

In [22]:
rows, columns = df.shape

print(f"Number of rows: {rows}")
print(f"Number of columns: {columns}")

Number of rows: 5847
Number of columns: 14

In [23]:
missing_values = df.isnull().sum()
print("Missing values per column:\n", missing_values)

Missing values per column:
 Unnamed: 0              0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  38
New_Price            5032
Price                   0
dtype: int64

In [33]:
# Clean and convert 'Power' column
df['Power'] = df['Power'].astype(str).str.replace(' bhp', '')  # Convert to string first, then remove ' bhp'
df['Power'] = pd.to_numeric(df['Power'], errors='coerce')       # Convert to float, with errors converted to NaN
df['Power'].fillna(df['Power'].median())          # Impute missing values with the median

# Clean and convert 'Mileage' column
df['Mileage'] = df['Mileage'].astype(str).str.replace(' kmpl', '').str.replace(' km/kg', '')  # Convert to string first, then clean up
df['Mileage'] = pd.to_numeric(df['Mileage'], errors='coerce')    # Convert to float, with errors converted to NaN
df['Mileage'].fillna(df['Mileage'].median())       # Impute missing values with the median

# I am imputing the columns with median values because the data is skewed numerical columns also removing the units in the column

0       19.67
1       13.00
2       20.77
3       15.20
4       23.08
        ...
5842    28.40
5843    24.40
5844    14.00
5845    18.90
5846    25.44
Name: Mileage, Length: 5847, dtype: float64

In [42]:
# Clean and convert 'Engine' column
df['Engine'] = df['Engine'].astype(str).str.replace(' CC', '')
df['Engine'] = pd.to_numeric(df['Engine'], errors='coerce')
df['Engine'].fillna(df['Engine'].median())

#again I am using median as it is more robust and represents
# central value which is not affected by extreme values whereas mean can be misleading

0       1582.0
1       1199.0
2       1248.0
3       1968.0
4       1461.0
         ...
5842    1248.0
5843    1120.0
5844    2498.0
5845     998.0
5846     936.0
Name: Engine, Length: 5847, dtype: float64

In [48]:
# Fill missing values in 'Seats' with mode
df['Seats'].fillna(df['Seats'].mode()[0])

#I am using mode here because it represents most common values in the column as it is
#ordinal in nature and discrete in count. If we use mean/median it could have resulted in decimal values which makes no sense for a column like SEATS

0       5.0
1       5.0
2       7.0
3       5.0
4       5.0
       ...
5842    5.0
5843    5.0
5844    8.0
5845    5.0
5846    5.0
Name: Seats, Length: 5847, dtype: float64

In [51]:
# performing one hot encoding on the categorical columns to make analysis better
categorical_cols = ['Fuel_Type', 'Transmission', 'Owner_Type', 'Location']
data = pd.get_dummies(df, columns=categorical_cols, drop_first=True)

print(data.head())

   Unnamed: 0                              Name  Year  Kilometers_Driven  \
0           1  Hyundai Creta 1.6 CRDi SX Option  2015              41000
1           2                      Honda Jazz V  2011              46000
2           3                 Maruti Ertiga VDI  2012              87000
3           4   Audi A4 New 2.0 TDI Multitronic  2013              40670
4           6            Nissan Micra Diesel XV  2013              86999

   Mileage  Engine   Power  Seats  New_Price  Price  ...  Location_Bangalore  \
0    19.67  1582.0  126.20    5.0      1.175  12.50  ...               False
1    13.00  1199.0   88.70    5.0      0.861   4.50  ...               False
2    20.77  1248.0   88.76    7.0      1.175   6.00  ...               False
3    15.20  1968.0  140.80    5.0      1.175  17.74  ...               False
4    23.08  1461.0   63.10    5.0      1.175   3.50  ...               False

   Location_Chennai  Location_Coimbatore  Location_Delhi  Location_Hyderabad  \
0             False                False           False               False
1              True                False           False               False
2              True                False           False               False
3             False                 True           False               False
4             False                False           False               False

   Location_Jaipur  Location_Kochi  Location_Kolkata  Location_Mumbai  \
0            False           False             False            False
1            False           False             False            False
2            False           False             False            False
3            False           False             False            False
4             True           False             False            False

   Location_Pune
0           True
1          False
2          False
3          False
4          False

[5 rows x 26 columns]

In [52]:
# Verify that all missing values are handled
print("Missing values after cleaning:\n", df.isnull().sum())

Missing values after cleaning:
 Unnamed: 0           0
Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
Engine               0
Power                0
Seats                0
New_Price            0
Price                0
dtype: int64

In [56]:
#adding new feature 'Power_to_weight' ratio to check cars with higher power-to-weight ratio tend to performe better which could be important for pricing metrics
data['Power_to_Weight'] = data['Power'] / data['Engine'] * 1000

print(data[['Name', 'Power', 'Engine', 'Power_to_Weight']].head())

                               Name   Power  Engine  Power_to_Weight
0  Hyundai Creta 1.6 CRDi SX Option  126.20  1582.0        79.772440
1                      Honda Jazz V   88.70  1199.0        73.978315
2                 Maruti Ertiga VDI   88.76  1248.0        71.121795
3   Audi A4 New 2.0 TDI Multitronic  140.80  1968.0        71.544715
4            Nissan Micra Diesel XV   63.10  1461.0        43.189596

In [63]:
# Select specific columns
selected_data = data[['Name', 'Year', 'Price']]

# Filter rows where price is above 10
filtered_data = data[data['Price'] > 10]

# Rename columns
renamed_data = data.rename(columns={'Price': 'Selling_Price', 'Kilometers_Driven': 'Mileage'})

# Add a new column for car age
data['Car_Age'] = 2024 - data['Year']

# Sort by price in descending order
arranged_data = data.sort_values(by='Price', ascending=False)

# Summarize data: calculate average and max price by location
summary_data = data.groupby('Price').agg(
    avg_price=('Price', 'mean'),
    max_price=('Price', 'max')
).reset_index()

print(selected_data.head())
print("-----------------------------------------")
print(filtered_data.head())
print("-----------------------------------------")
print(renamed_data.head())
print("-----------------------------------------")
print(arranged_data.head())
print("-----------------------------------------")
print(summary_data.head())

                               Name  Year  Price
0  Hyundai Creta 1.6 CRDi SX Option  2015  12.50
1                      Honda Jazz V  2011   4.50
2                 Maruti Ertiga VDI  2012   6.00
3   Audi A4 New 2.0 TDI Multitronic  2013  17.74
4            Nissan Micra Diesel XV  2013   3.50
-----------------------------------------
    Unnamed: 0                               Name  Year  Kilometers_Driven  \
0            1   Hyundai Creta 1.6 CRDi SX Option  2015              41000
3            4    Audi A4 New 2.0 TDI Multitronic  2013              40670
5            7  Toyota Innova Crysta 2.8 GX AT 8S  2016              36000
11          13   Land Rover Range Rover 2.2L Pure  2014              72000
12          14     Land Rover Freelander 2 TD4 SE  2012              85000

    Mileage  Engine  Power  Seats  New_Price  Price  ...  Location_Coimbatore  \
0     19.67  1582.0  126.2    5.0      1.175  12.50  ...                False
3     15.20  1968.0  140.8    5.0      1.175  17.74  ...                 True
5     11.36  2755.0  171.5    8.0      2.100  17.50  ...                False
11    12.70  2179.0  187.7    5.0      1.175  27.00  ...                False
12     0.00  2179.0  115.0    5.0      1.175  17.50  ...                False

    Location_Delhi  Location_Hyderabad  Location_Jaipur  Location_Kochi  \
0            False               False            False           False
3            False               False            False           False
5            False               False            False           False
11            True               False            False           False
12           False               False            False           False

    Location_Kolkata  Location_Mumbai  Location_Pune  Power_to_Weight  Car_Age
0              False            False           True        79.772440        9
3              False            False          False        71.544715       11
5              False             True          False        62.250454        8
11             False            False          False        86.140431       10
12             False            False           True        52.776503       12

[5 rows x 28 columns]
-----------------------------------------
   Unnamed: 0                              Name  Year  Mileage  Mileage  \
0           1  Hyundai Creta 1.6 CRDi SX Option  2015    41000    19.67
1           2                      Honda Jazz V  2011    46000    13.00
2           3                 Maruti Ertiga VDI  2012    87000    20.77
3           4   Audi A4 New 2.0 TDI Multitronic  2013    40670    15.20
4           6            Nissan Micra Diesel XV  2013    86999    23.08

   Engine   Power  Seats  New_Price  Selling_Price  ...  Location_Coimbatore  \
0  1582.0  126.20    5.0      1.175          12.50  ...                False
1  1199.0   88.70    5.0      0.861           4.50  ...                False
2  1248.0   88.76    7.0      1.175           6.00  ...                False
3  1968.0  140.80    5.0      1.175          17.74  ...                 True
4  1461.0   63.10    5.0      1.175           3.50  ...                False

   Location_Delhi  Location_Hyderabad  Location_Jaipur  Location_Kochi  \
0           False               False            False           False
1           False               False            False           False
2           False               False            False           False
3           False               False            False           False
4           False               False             True           False

   Location_Kolkata  Location_Mumbai  Location_Pune  Power_to_Weight  Car_Age
0             False            False           True        79.772440        9
1             False            False          False        73.978315       13
2             False            False          False        71.121795       12
3             False            False          False        71.544715       11
4             False            False          False        43.189596       11

[5 rows x 28 columns]
-----------------------------------------
      Unnamed: 0                                         Name  Year  \
3952        4079  Land Rover Range Rover 3.0 Diesel LWB Vogue  2017
5620        5781                   Lamborghini Gallardo Coupe  2011
5752        5919                       Jaguar F Type 5.0 V8 S  2015
1457        1505              Land Rover Range Rover Sport SE  2019
1917        1974                           BMW 7 Series 740Li  2018

      Kilometers_Driven  Mileage  Engine  Power  Seats  New_Price   Price  \
3952              25000    13.33  2993.0  255.0    5.0     23.000  160.00
5620               6500     6.40  5204.0  560.0    2.0      1.175  120.00
5752               8000    12.50  5000.0  488.1    2.0      1.175  100.00
1457              26013    12.65  2993.0  255.0    5.0     13.900   97.07
1917              28060    12.05  2979.0  320.0    5.0      1.175   93.67

      ...  Location_Coimbatore  Location_Delhi  Location_Hyderabad  \
3952  ...                False           False                True
5620  ...                False            True               False
5752  ...                False           False                True
1457  ...                False           False               False
1917  ...                 True           False               False

      Location_Jaipur  Location_Kochi  Location_Kolkata  Location_Mumbai  \
3952            False           False             False            False
5620            False           False             False            False
5752            False           False             False            False
1457            False            True             False            False
1917            False           False             False            False

      Location_Pune  Power_to_Weight  Car_Age
3952          False        85.198797        7
5620          False       107.609531       13
5752          False        97.620000        9
1457          False        85.198797        5
1917          False       107.418597        6

[5 rows x 28 columns]
-----------------------------------------
   Price  avg_price  max_price
0   0.44       0.44       0.44
1   0.45       0.45       0.45
2   0.50       0.50       0.50
3   0.51       0.51       0.51
4   0.53       0.53       0.53